tutorials/compressible/rhopSonicFoam/wedge15Ma5/constant/thermodynamicProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermodynamicProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Cv              Cv [ 0 2 -2 -1 0 0 0 ] 1.78571;

R               R [ 0 2 -2 -1 0 0 0 ] 0.714286;

// ************************************************************************* //
